package by.epam.stady.stringcharacterarray;

/* Удалить в строке все лишние пробелы, то есть серии идущих пробелов заменить
* на одиночные пробелы. Крайние пробелы в строке удалить.*/

public class Task5 {
    public static void main(String[] args) {
        String line = " 965 г. - Разгром   Хазарского каганата войском Киевского князя Святослава Игоревича. " +
                "988 г. -     Крещение    Руси.    Киевская Русь принимает православное христианство. " +
                "1223 г. -    Битва на Калке - первое сражение между русскими и моголами." +
                "1240 г. - Невская битва - военный конфликт между русскими_test12345_test во главе с новгородским князем Александром и шведами." +
                "1242 г. -     Битва на    Чудском озере - сражение между русскими во главе с Александром Невским и рыцарями Ливонского ордена. Эта битва вошла в историю, как Ледовое побоище" +
                "Подробнее." +
                "1380 г. - Куликовская битва - сражение между объединенной армией русских княжеств во главе с Дмитрием Донским и армией Золотой Орды во главе с Мамаем. Подробнее" +
                "   1556 г. — Присоединение Астраханского ханства к Москвкой Руси.\n" +
                "\n" +
                "1558 — 1583 г. — Ливонская война. Война Русского царства против Ливонского ордена и последующий конфликт Русского царства с Великим княжеством Литовским, Польшей и Швецией.";


       // searchCountNumbersInLine(line);
    }


    /*public static int searchCountNumbersInLine(String line) {

        String newString = line.replaceAll("\\s+", " ").trim();*//* \\s - пробельный символ, +обозначает «один или
        несколько экземпляров непосредственно предшествующего элемента, а у нас это пробел, сдвигает сборку*//*

        System.out.println(newString);

        return newString.length();
    }*/

  //  public static int searchCountNumbersInLine(String line) {



   // }
}
