package by.epam.stady.stringcharacterarray;

/* В строке найти количество цифр*/

import java.util.Arrays;
import java.util.List;

public class Task3 {
    public static void main(String[] args) {
        String line = "  965 5 6 67г. - Разгром Хазарского каганата войском Киевского князя Святослава Игоревича. ";/* +
                "988 г. - Крещение Руси. Киевская Русь принимает православное христианство. " +
                "1223 г. - Битва на Калке - первое сражение между русскими и моголами." +
                "1240 г. - Невская битва - военный конфликт между русскими_test12345_test во главе с новгородским князем Александром и шведами." +
                "1242 г. - Битва на Чудском озере - сражение между русскими во главе с Александром Невским и рыцарями Ливонского ордена. Эта битва вошла в историю, как Ледовое побоище" +
                "Подробнее." +
                        "1380 г. - Куликовская битва - сражение между объединенной армией русских княжеств во главе с Дмитрием Донским и армией Золотой Орды во главе с Мамаем. Подробнее" +
                        "1556 г. — Присоединение Астраханского ханства к Москвкой Руси.\n" +
                "\n" +
                "1558 — 1583 г. — Ливонская война. Война Русского царства против Ливонского ордена и последующий конфликт Русского царства с Великим княжеством Литовским, Польшей и Швецией.";
*/

        searchCountDigitInLine(line);
    }

    public static int searchCountDigitInLine(String line){

        int count = 0;

        char[] charArray = line.toCharArray();

        for (int i = 0; i < charArray.length; i++){
            if (Character.isDigit(charArray[i])){
                count++;
            }
        }
        System.out.println(count);
        return count;
    }

    /*public static int searchCountDigitInLine(String line){

        int count = line.replaceAll("[^0-9]+", "").length(); *//* ^ - убираем все строки (без ^ - останутся наоборот только слова без чисел), заменяем убранные строки на
        без пробела, получается строка с набором цифр без пробелов. Узнаем длину строки*//*
        System.out.println(line.replaceAll("[^0-9]+", "").length());

        return count;
    }*/
}
